#include <stdio.h>

int main() {

	//1.1차원 배열의 합, 평균 출력
		// 20 34 22 14 36 23 67 -> 7


	//2.1~ 100까지의 수를 1차원 배열에 저장
		//5의 배수만 출력
		//배열의 위치가 90번째 일떄 출력을 중지

	//3.데이터를 배열에 저장한후  출력
		//배열의 초기값 10 20 30 40 ... 100
		//새로운 배열을 선언하여 100 90 80 70 으로 저장하여 출력

	//4.이차원 배열의 출력
		//{{1,2},{2,4,6},{3,6}{4,8,10,12}{10}}
		//arr[0][0] = 1 arr[0][1] = 2 형태로 출력

	//5.행렬의 덧셈
		//1~9까지의 행렬을 2차원 배열에 저장
		//10~90까지의 행렬을 2차원 배열에 저장
		//두 행렬을 덧셈하여 2차원 배열에 저장
		//11 22 33 -> 형태로 출력
		//44 55 66

	//6.구구단의 결과를 2차원 배열에 저장 
		//결과값을 따로 저장 2차원 배열
		//2x1=2 3x1=3 형태


	/*7.
	-------------------------
	파일 제어 프로그램
	-------------------------
	1.이름 생성 파일에 저장
	2.파일에서 이름 읽어오기
	3.프로그램 종료
	-------------------------
		이름 1 ->"김","박","이","최","장"
		이름 2 ->"바", "사", "아", "자", "차"
		이름 3 ->"가", "나", "다", "라", "마"

	랜덤하게 발생하도록 하여 50개의 풀네임 생성후 배열에 저장 
	*/

	//8.1~45 의 숫자를 랜덤에게 발생 시켜 로또 프로그램 만들기


}